SimulationDatabase/CurvedBackwardFacingStep/Template/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    bottomWall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           uniform 0;
    }
    topWall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
150
(
128.317021304
35.1539759612
17.0971262943
10.545137814
7.4083024045
5.62189350307
4.4840535356
3.70160970738
...
)
;
    }
}


// ************************************************************************* //
